{
  "html5": "Standard markup language for creating web page structure. HTML5 introduces new semantic features and modern APIs for a better user experience.",
  "css3": "Style language for web page presentation. CSS3 brings advanced features like animations, transitions, flexbox and grid for modern and responsive designs.",
  "javascript": "Dynamic programming language for the web. JavaScript allows adding interactivity, manipulating the DOM and creating complex web applications on both client and server side.",
  "react": "JavaScript library for building user interfaces. React uses a reusable component system and virtual DOM for performant and maintainable applications.",
  "nextjs": "Full-stack React framework with server-side rendering, static generation and API routes. Next.js optimizes performance and SEO for modern web applications.",
  "vuejs": "Progressive JavaScript framework for building user interfaces. Vue.js combines ease of use with powerful features and excellent performance.",
  "sass": "CSS preprocessor that extends CSS functionality with variables, mixins, functions and cleaner syntax for more efficient development.",
  "tailwind": "Utility-first CSS framework that allows building designs quickly using predefined classes. Ideal for rapid prototyping and consistent designs.",
  "bootstrap": "Popular CSS framework that provides pre-built components and a responsive grid system to accelerate user interface development.",
  "nodejs": "Server-side JavaScript runtime based on Chrome's V8 engine. Node.js enables developing performant backend applications with JavaScript and the NPM package ecosystem.",
  "nestjs": "Progressive Node.js framework for building efficient and scalable server applications. NestJS uses TypeScript and follows modular architecture principles.",
  "java": "Object-oriented, portable and robust programming language. Java is widely used for enterprise application development, APIs and distributed systems.",
  "spring": "Java framework that simplifies Spring application development with auto-configuration and starters. Ideal for creating microservices and REST APIs.",
  "python": "Versatile, simple and powerful programming language. Python is excellent for web development, data analysis, automation and artificial intelligence.",
  "flask": "Lightweight and flexible Python web framework. Flask follows the 'micro' principle and allows quickly building simple to complex web applications.",
  "php": "Popular server-side scripting language for web development. PHP is particularly suited for creating dynamic websites and web applications.",
  "codeigniter": "Lightweight and simple PHP framework for rapid web application development. CodeIgniter follows the MVC pattern and offers a gentle learning curve.",
  "docker": "Containerization platform that allows packaging applications with their dependencies. Docker simplifies deployment and ensures consistency between development and production environments.",
  "gitlab": "Complete DevOps platform that provides Git repository, CI/CD, and project management tools. GitLab enables managing the entire software development lifecycle.",
  "git": "Distributed version control system that allows tracking source code changes. Git is essential for team collaboration and project version management.",
  "github": "Git-based source code hosting platform. GitHub offers collaboration features, project management and continuous integration for developers.",
  "vercel": "Deployment platform optimized for Next.js and React applications. Vercel offers automatic deployment, global CDN and advanced performance features.",
  "supabase": "Open-source Firebase alternative that provides PostgreSQL database, authentication, and real-time APIs. Supabase simplifies full-stack application development.",
  "mysql": "Open-source relational database management system. MySQL is widely used for storing and managing structured data in web applications.",
  "mysqlworkbench": "MySQL database design and administration tool. MySQL Workbench allows designing, developing and administering MySQL databases visually.",
  "linux": "Open-source Unix-based operating system. Linux is widely used for servers, development and offers great flexibility and security.",
  "ubuntu": "Debian-based Linux distribution known for its ease of use. Ubuntu is popular for development and offers excellent community support.",
  "terminal": "Command-line interface for interacting with the operating system. The terminal allows executing commands, managing files and automating development tasks.",
  "figma": "Collaborative online design tool for creating user interfaces, prototypes and designs. Figma enables real-time collaboration and integration with development tools.",
  "postman": "API development platform that allows testing, documenting and sharing APIs. Postman simplifies REST and GraphQL API development and testing.",
  "photoshop": "Professional image editing and retouching software. Photoshop is used for creating designs, retouching photos and preparing visual assets for the web.",
  "illustrator": "Vector graphics creation software for creating logos, icons and illustrations. Illustrator is ideal for creating scalable and professional designs.",
  "office": "Complete office suite including Word, Excel, PowerPoint and Outlook. Microsoft Office is essential for documentation, presentations and project management.",
  "vscode": "Free and open-source source code editor developed by Microsoft. VS Code offers an excellent development experience with extensions, integrated debugger and Git.",
  "cursor": "AI-powered code editor that enhances development productivity. Cursor integrates AI features for auto-completion, code generation and development assistance.",
  "wordpress": "Open-source content management system (CMS) for creating websites and blogs. WordPress is flexible, extensible and widely used for all types of websites.",
  "joomla": "Open-source content management system for creating complex websites. Joomla offers great flexibility and advanced features for enterprise sites."
}
