{
  "experiences": [
    {
      "id": 11,
      "title": "Software Engineer",
      "company": "Ultra Tech Alliance (UTA)",
      "location": "Paris, Île-de-France, France · Remote",
      "date": "Oct 2024 - Present",
      "description": "Contributing to the development of open-source tools and libraries for the Ultra blockchain ecosystem. Implementing features and improving SDKs, scripts, and automation tools for developers. Participating in technical workshops and developer meetups to support community growth. Collaborating with engineers and contributors to build resources and documentation for the Ultra developer community. Actively supporting the adoption of Ultra's technology through hands-on development and knowledge sharing.",
      "technologies": [
        "React.js",
        "Node.js",
        "NestJS",
        "C++",
        "Git",
        "Artificial Intelligence (AI)",
        "Agile Project Management"
      ],
      "achievements": [
        "Contributing to the development of open-source tools and libraries for the Ultra blockchain ecosystem",
        "Implementing features and improving SDKs, scripts, and automation tools for developers",
        "Participating in technical workshops and developer meetups to support community growth",
        "Collaborating with engineers and contributors to build resources and documentation for the Ultra developer community",
        "Actively supporting the adoption of Ultra's technology through hands-on development and knowledge sharing",
        "Impact: Enhanced Ultra's developer ecosystem by delivering reliable, developer-focused tooling and improving onboarding resources, empowering builders and accelerating adoption across the platform"
      ]
    },
    {
      "id": 10,
      "title": "Junior Software Engineer",
      "company": "Black Ice Studios Inc.",
      "location": "Montréal, Québec, Canada · Remote",
      "date": "Aug 2025 - Present",
      "description": "Development of the Web3 (blockchain) component of the game Ashes of Mankind (Empires). Implementation of the entire Web3 frontend and interaction with smart contracts. Participation in daily meetings and technical discussions in English.",
      "technologies": [
        "React.js",
        "Node.js",
        "NestJS",
        "Blockchain",
        "Web3",
        "Smart Contracts",
        "Agile",
        "Git",
        "GitLab",
        "Tailwind"
      ],
      "achievements": [
        "Development of the Web3 integration layer of Ashes of Mankind (Empires) game",
        "Complete implementation of Web3 frontend and smart contract interaction",
        "Participation in daily meetings and technical discussions in English",
        "Agile environment collaboration with international teams",
        "Coordination with global teams for technical alignment"
      ]
    },
    {
      "id": 7,
      "title": "Moderator",
      "company": "Ultra",
      "location": "Paris, Île-de-France, France · Remote",
      "date": "Mar 2025 - Oct 2025",
      "description": "Moderating international communities, organizing events and helping users. Participating in Black Ice Studios (Ashes of Mankind) game social networks moderation.",
      "technologies": [
        "Community Management",
        "Event Organization",
        "Social Media Moderation",
        "International Communities",
        "Gaming Industry",
        "Online Community Moderation"
      ],
      "achievements": [
        "Moderating international communities",
        "Event organization",
        "User assistance",
        "Participation in Black Ice Studios (Ashes of Mankind) game social networks moderation",
        "Online community moderation"
      ]
    },
    {
      "id": 8,
      "title": "Lead Developer & MVP",
      "company": "Ultra Times",
      "location": "Bangkok, Thailand · Remote",
      "date": "Jan 2025 - Present",
      "description": "Leading the technical design, development, and deployment of 7 decentralized applications on the Ultra blockchain, overseeing fullstack architecture and ensuring scalability and security. Participating in strategic decision-making as part of the management team, aligning technical initiatives with business goals and fundraising objectives. Authoring technical content and engaging with the community in English and French, including interviews with blockchain and game developers, enhancing the platform's visibility and thought leadership. Managing Agile sprints, coordinating development workflows, and ensuring timely delivery of MVPs on Ultra blockchain-based projects.",
      "technologies": [
        "React.js",
        "Node.js",
        "NestJS",
        "Blockchain",
        "Ultra Blockchain",
        "Fullstack Architecture",
        "Agile Project Management",
        "Technical Writing",
        "Community Management",
        "Leadership",
        "Strategic Decision Making",
        "Git"
      ],
      "achievements": [
        "Led the technical design, development, and deployment of 7 decentralized applications on the Ultra blockchain, overseeing fullstack architecture and ensuring scalability and security",
        "Participated in strategic decision-making as part of the management team, aligning technical initiatives with business goals and fundraising objectives",
        "Authored technical content and engaged with the community in English and French, including interviews with blockchain and game developers, enhancing the platform's visibility and thought leadership",
        "Managed Agile sprints, coordinated development workflows, and ensured timely delivery of MVPs on Ultra blockchain-based projects"
      ]
    },
    {
      "id": 9,
      "title": "Junior Software Engineer and Community Contributor",
      "company": "Ultra Times",
      "location": "Bangkok, Thailand · Remote",
      "date": "Oct 2024 - Present",
      "description": "Development using the Ultra blockchain and its APIs, writing technical articles about it, and participating in community activities in both English and French (community engagement, interviews, etc...).",
      "technologies": [
        "Ultra Blockchain",
        "API Development",
        "Technical Writing",
        "Community Management",
        "English",
        "French",
        "Blockchain Development"
      ],
      "achievements": [
        "Development using the Ultra blockchain and its APIs",
        "Writing technical articles about the Ultra blockchain",
        "Participation in community activities in English and French",
        "Community engagement and interviews"
      ]
    },
    {
      "id": 1,
      "title": "Junior Software Engineer",
      "company": "SNCF Voyageurs",
      "location": "Paris, Île-de-France, France",
      "date": "Sep 2024 - Present",
      "description": "Designing application solutions to optimize agents' work.",
      "technologies": [
        "Application Design",
        "Software Engineering",
        "Agent Optimization"
      ],
      "achievements": [
        "Designing application solutions to optimize agents' work",
        "Internal application development",
        "Collaboration with business teams"
      ]
    },
    {
      "id": 3,
      "title": "Founder and Director",
      "company": "DigitalLabs TM",
      "location": "France",
      "date": "Oct 2023 - Present",
      "description": "IT services and custom software development company.",
      "technologies": [
        "Business Management",
        "Software Development",
        "IT Services",
        "Project Management"
      ],
      "achievements": [
        "Creation and management of an IT services company",
        "Custom software development",
        "Client relationship and project management"
      ]
    },
    {
      "id": 2,
      "title": "Web Developer",
      "company": "SNCF Voyageurs",
      "location": "Paris, Île-de-France, France",
      "date": "Sep 2023 - Sep 2024",
      "description": "Production and maintenance of internal applications.",
      "technologies": [
        "Agile Project Management",
        "NestJS",
        "React.js",
        "TypeScript",
        "JavaScript",
        "CodeIgniter",
        "PHP",
        "Git",
        "MySQL",
        "MySQL Workbench",
        "HTML",
        "CSS3",
        "Bootstrap"
      ],
      "achievements": [
        "Production and maintenance of internal applications",
        "Development with NestJS and React.js",
        "Agile project management",
        "Use of CodeIgniter and PHP"
      ]
    },
    {
      "id": 4,
      "title": "Webmaster",
      "company": "Osmoz Communication",
      "location": "Coulommiers, Île-de-France, France",
      "date": "Dec 2021 - Aug 2023",
      "description": "I was in charge of the company's online communication by developing a complete set of websites to promote the products and services sold by the brand. I also managed the social networks and acquired many soft skills, especially in communication thanks to the customer relationship I was often confronted with. This experience allowed me to learn how to manage projects and made me gain confidence.",
      "technologies": [
        "Social Media Marketing",
        "Self-taught",
        "Rigor",
        "Adobe Illustrator",
        "JavaScript",
        "MySQL",
        "PHP",
        "Search Engine Optimization (SEO)",
        "Adaptation",
        "CSS3",
        "Communication",
        "WordPress",
        "Microsoft Office",
        "HTML",
        "Content Management Systems (CMS)"
      ],
      "achievements": [
        "Development of a complete set of websites",
        "Social media management",
        "Acquisition of client communication skills",
        "Project management and confidence building"
      ]
    },
    {
      "id": 5,
      "title": "Freelance in Digital Marketing",
      "company": "ComeUp",
      "location": "France",
      "date": "Apr 2018 - Dec 2021",
      "description": "I started missions at the age of 17 at the same time as high school and stopped a little over three years later to devote myself fully to my studies. I learned project management, time and stress management and customer relations, while developing skills in several areas (video and image advertising, SEO writing, websites...). I accompanied more than 300 clients with 100% positive reviews and recommendations.",
      "technologies": [
        "Social Media Marketing",
        "Self-taught",
        "Rigor",
        "Search Engine Optimization (SEO)",
        "Adaptation",
        "Communication",
        "Microsoft Office",
        "Client Relationship Management"
      ],
      "achievements": [
        "Accompanied more than 300 clients with 100% positive reviews and recommendations",
        "Started missions at age 17 alongside high school",
        "Learned project management",
        "Time and stress management",
        "Developed skills in video and image advertising",
        "SEO writing and website development",
        "Excellence in client relations and customer satisfaction"
      ]
    }
  ]
}
